orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
                  }
                  if(i==1)
                  {
                    ESPNow.remove_peer(g_pedalMac_aau8[1]);
                    memcpy(&g_pedalMac_aau8[1],&g_espPairingReg_st.pairMac_aau8[i],6);
                    delay(300);
                    ESPNow.add_peer(g_pedalMac_aau8[1]);
                    //ActiveSerial->printf("[L]Mac: %02X:%02X:%02X:%02X:%02X:%02X\n", g_pedalMac_aau8[1][0], g_pedalMac_aau8[1][1], g_pedalMac_aau8[1][2], g_pedalMac_aau8[1][3], g_pedalMac_aau8[1][4], g_pedalMac_aau8[1][5]);

                  }
                  if(i==2)
                  {
                    ESPNow.remove_peer(g_pedalMac_aau8[2]);
                    memcpy(&g_pedalMac_aau8[2],&g_espPairingReg_st.pairMac_aau8[i],6);
                    delay(300);
                    ESPNow.add_peer(g_pedalMac_aau8[2]);
                  }        
                  if(i==3)
                  {
                    ESPNow.remove_peer(g_espHost_au8);
                    memcpy(&g_espHost_au8,&g_espPairingReg_st.pairMac_aau8[i],6);
                    delay(300);
                    ESPNow.add_peer(g_espHost_au8);                
                  }        
                }
              }
              */
            }
            
          }
        }
      #endif


      for(int i=0;i<3;i++)
      {
        if(configUpdateAvailable[i])
        {
          configUpdateAvailable[i] = false;
          if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[i]==1)
          {
            esp_err_t err;
            ActiveSerial->printf("[L]Sending Pedal #%d config, Result:", i);
            err = wirelessComm.sendConfigToPedal(i, dap_config_st[i]);
            ActiveSerial->println(esp_err_to_name(err));
            #ifdef USB_JOYSTICK
              tinyusbJoystick_.printf("Forward config to Pedal: %d, result:%s", i, esp_err_to_name(err));
            #endif
          }
        }
      }
      

      for(int i=0; i<3; i++)
      {
        if(dap_action_update[i] )
        {
          dap_action_update[i]=false;
          if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[i]==1)
          {
            if (i == PEDAL_ID_BRAKE &&
                dap_actions_st[i].payloadPedalAction_st.rudderAction_u8 != 0 &&
                dap_actions_st[i].payloadPedalAction_st.systemAction_u8 == 0) {
              syncPairingTableToPedals();
            }
            wirelessComm.sendActionToPedal(i, dap_actions_st[i]);
          }
        }

        // --- ADDED: Forward Servo Config to Pedals ---
        for(int s=0; s<3; s++)
        {
          if(update_servo_config[s])
          {
            update_servo_config[s] = false;
            if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[s]==1)
            {
              wirelessComm.sendServoConfigToPedal(s, dap_servo_config_st[s]);
            }
          }
        }

      }


    
      //forward the basic wifi info for pedals
      if(g_pedalOtaAction_b)
      {
        if (dap_action_ota_st.payloadOtaInfo_st.deviceId_u8 < 3) {
          wirelessComm.sendOtaToPedal(dap_action_ota_st.payloadOtaInfo_st.deviceId_u8, dap_action_ota_st);
          ActiveSerial->printf("[L]Forward OTA command to Pedal #%d\n", dap_action_ota_st.payloadOtaInfo_st.deviceId_u8);
        }
        g_pedalOtaAction_b=false;
      }
    }    
  }
}


void clearPedalAssignmentAction(uint8_t targetIdx, const DapActions_t &action)
{
  if (targetIdx > 2) return;
  uint8_t targetMac[6] = {0};
  bool hasMac = false;
  for (int b = 0; b < 6; b++) {
    if (wirelessComm.getPedalMac(targetIdx)[b] != 0) {
      hasMac = true;
      break;
    }
  }
  if (!hasMac) {
    for (int b = 0; b < 6; b++) {
      if (g_espPairingReg_st.pairMac_aau8[targetIdx][b] != 0) {
        hasMac = true;
        break;
      }
    }
    if (hasMac) {
      memcpy(targetMac, g_espPairingReg_st.pairMac_aau8[targetIdx], 6);
    }
  } else {
    memcpy(targetMac, wirelessComm.getPedalMac(targetIdx), 6);
  }

  if (hasMac) {
    wirelessComm.sendBroadcastRetry((const uint8_t*)&action, sizeof(DapActions_t), 5, 20);
  }

  // Clear pairing in EEPROM & RAM
  g_espPairingReg_st.pairStatus_au8[targetIdx] = 0;
  memset(g_espPairingReg_st.pairMac_aau8[targetIdx], 0, 6);
  EEPROM.put(EEPROM_offset, g_espPairingReg_st);
  EEPROM.commit();
  uint8_t zeroMac[6] = {0};
  wirelessComm.setPedalMac(targetIdx, zeroMac);
  dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[targetIdx] = 0;

  ActiveSerial->printf("[L]Cleared assignment for pedal %d and sent CLEAR_ASSIGNMENT action\n", targetIdx);
  syncPairingTableToPedals();
}

void pushPedalAssignmentAction(uint8_t sourceTag, uint8_t newRole, const DapActions_t &action)
{
  if (newRole > 2) {
    ActiveSerial->printf("[L]pushPedalAssignmentAction: invalid target role %d\n", newRole);
    return;
  }
  if (sourceTag > 7) {
    ActiveSerial->printf("[L]pushPedalAssignmentAction: invalid source tag %d\n", sourceTag);
    return;
  }

  uint8_t targetMac[6] = {0};
  bool foundMac = false;

  // Prüfe ob Quell-MAC bereits bekannt ist
  if (sourceTag < 3) {
    for (int b = 0; b < 6; b++) {
      if (wirelessComm.getPedalMac(sourceTag)[b] != 0) {
        foundMac = true;
        break;
      }
    }
    if (foundMac) {
      memcpy(targetMac, wirelessComm.getPedalMac(sourceTag), 6);
    }
  }
  if (!foundMac) {
    ActiveSerial->printf("[L]pushPedalAssignmentAction: No MAC known for tag %d\n", sourceTag);
    return;
  }

  // Broadcast a few times for reliability - no unicast peer/ACK needed.
  wirelessComm.sendBroadcastRetry((const uint8_t*)&action, sizeof(DapActions_t), 3, 20);
  ActiveSerial->printf("[L]Assignment action sent to pedal: %02X:%02X:%02X:%02X:%02X:%02X, new role: %d\n",
                       targetMac[0], targetMac[1], targetMac[2], targetMac[3], targetMac[4], targetMac[5], newRole);

  // Bridge merkt sich die MAC-Adresse im RAM & EEPROM
  if (sourceTag != newRole) {
    wirelessComm.setPedalMac(newRole, targetMac);
    if (sourceTag >= 3) {
      uint8_t zeroMac[6] = {0};
      wirelessComm.setPedalMac(sourceTag, zeroMac);
    }

    memcpy(g_espPairingReg_st.pairMac_aau8[newRole], targetMac, 6);
    g_espPairingReg_st.pairStatus_au8[newRole] = 1;
    EEPROM.put(EEPROM_offset, g_espPairingReg_st);
    EEPROM.commit();

    syncPairingTableToPedals();
  }
}

//serial communication recieve task
bool PedalUpdateIntervalPrint_b=false;
unsigned long PedalUpdateLast=0;
unsigned long UARTJoystickUpdateLast=0;
bool isBridgeInDebugMode_b=false;
bool UARTJoystickUpdate_b=false;
int joystick_fake_value=0;

