orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
typedef struct {
    uint16_t startBytePos_u16;
    uint16_t endBytePos_u16;
    uint16_t payloadType_u16;
    bool validFlag_b;
} structChecker_st;

// Helper function to determine expected packet size from payload type
// Returns 0 if the payload type is unknown.
static inline size_t getExpectedPacketSize(uint8_t payloadType) {
    switch (payloadType) {
        case DAP_PAYLOAD_TYPE_CONFIG_U8:
            return sizeof(DapConfig_t);
        case DAP_PAYLOAD_TYPE_ACTION_U8:
            return sizeof(DapActions_t);
        case DAP_PAYLOAD_TYPE_ACTION_OTA_U8:
            return sizeof(DapActionOta_t);
        case DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8:
            return sizeof(DapBridgeState_t);
        case DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8:
            return sizeof(DAP_servo_config_st_t);
        case DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8:
            return sizeof(DapWifiChannel_t);
        case DAP_PAYLOAD_TYPE_MAC_ADDRESSES_U8:
            return sizeof(DapMacAddresses_t);
        // Add other packet types here in the future
        default:
            return 0;
    }
}
void handleWifiScanRequest(bool isHid) {
  ActiveSerial->println("[L]Scanning Wi-Fi channels...");
  int n = WiFi.scanNetworks(false, true);
  int apCount[15] = {0};
  int bestRssi[15];
  for (int i = 0; i < 15; i++) bestRssi[i] = -120;
  int score[15] = {0};

  for (int i = 0; i < n; i++) {
    int ch = WiFi.channel(i);
    int32_t rssi = WiFi.RSSI(i);
    if (ch >= 1 && ch <= 13) {
      apCount[ch]++;
      if (rssi > bestRssi[ch]) {
        bestRssi[ch] = rssi;
      }
      int weight = constrain((int)(rssi + 110) / 2, 5, 50);
      score[ch] += weight;
      if (ch > 1) score[ch - 1] += weight / 2;
      if (ch < 13) score[ch + 1] += weight / 2;
      if (ch > 2) score[ch - 2] += weight / 4;
      if (ch < 12) score[ch + 2] += weight / 4;
    }
  }
  WiFi.scanDelete();

  esp_wifi_set_channel(wirelessComm.getChannel(), WIFI_SECOND_CHAN_NONE);

  uint8_t recommended = 1;
  int minScore = score[1];
  if (score[6] < minScore) {
    minScore = score[6];
    recommended = 6;
  }
  if (score[11] < minScore) {
    minScore = score[11];
    recommended = 11;
  }

  DapWifiChannel_t resp = {};
  resp.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
  resp.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
  resp.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8;
  resp.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
  resp.payloadHeader_st.pedalTag_u8 = 3;
  resp.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SCAN_RES;
  resp.payloadWifiChannel_st.currentChannel_u8 = wirelessComm.getChannel();
  resp.payloadWifiChannel_st.recommendedChannel_u8 = recommended;
  resp.payloadWifiChannel_st.channel1Rssi_i8 = (bestRssi[1] > -120) ? (int8_t)bestRssi[1] : (int8_t)0;
  resp.payloadWifiChannel_st.channel6Rssi_i8 = (bestRssi[6] > -120) ? (int8_t)bestRssi[6] : (int8_t)0;
  resp.payloadWifiChannel_st.channel11Rssi_i8 = (bestRssi[11] > -120) ? (int8_t)bestRssi[11] : (int8_t)0;
  resp.payloadWifiChannel_st.channel1ApCount_u8 = (uint8_t)constrain(apCount[1], 0, 255);
  resp.payloadWifiChannel_st.channel6ApCount_u8 = (uint8_t)constrain(apCount[6], 0, 255);
  resp.payloadWifiChannel_st.channel11ApCount_u8 = (uint8_t)constrain(apCount[11], 0, 255);
  resp.payloadWifiChannel_st.channel1ApScore_u8 = (uint8_t)constrain(score[1], 0, 100);
  resp.payloadWifiChannel_st.channel6ApScore_u8 = (uint8_t)constrain(score[6], 0, 100);
  resp.payloadWifiChannel_st.channel11ApScore_u8 = (uint8_t)constrain(score[11], 0, 100);
  resp.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
  resp.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
  resp.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(resp.payloadHeader_st)), sizeof(resp.payloadHeader_st) + sizeof(resp.payloadWifiChannel_st));

#ifdef USB_JOYSTICK
  if (isHid) {
    tinyusbJoystick_.sendData((uint8_t*)&resp, sizeof(DapWifiChannel_t));
  } else {
    ActiveSerial->write((uint8_t*)&resp, sizeof(DapWifiChannel_t));
  }
#else
  ActiveSerial->write((uint8_t*)&resp, sizeof(DapWifiChannel_t));
#endif
  ActiveSerial->printf("[L]Scan done. Best channel: %d (Score Ch1: %d, Ch6: %d, Ch11: %d)\n", recommended, score[1], score[6], score[11]);
}

void handleWifiSetChannelRequest(uint8_t newChannel, bool isHid) {
  if (newChannel < 1 || newChannel > 14) return;
  ActiveSerial->printf("[L]Switching Wi-Fi channel from %d to %d...\n", wirelessComm.getChannel(), newChannel);

  DapWifiChannel_t fwd = {};
  fwd.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
  fwd.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
  fwd.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8;
  fwd.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
  fwd.payloadHeader_st.pedalTag_u8 = 3;
  fwd.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SET_REQ;
  fwd.payloadWifiChannel_st.currentChannel_u8 = newChannel;
  fwd.payloadWifiChannel_st.recommendedChannel_u8 = newChannel;
  fwd.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
  fwd.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
  fwd.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(fwd.payloadHeader_st)), sizeof(fwd.payloadHeader_st) + sizeof(fwd.payloadWifiChannel_st));

  // Broadcast a few times over ~200ms for reliability - no unicast peer/ACK needed.
  wirelessComm.sendBroadcastRetry((const uint8_t*)&fwd, sizeof(DapWifiChannel_t), 4, 50);

  saveWifiChannelToEeprom(newChannel);
  wirelessComm.setChannel(newChannel);

  delay(20);
  esp_wifi_set_channel(newChannel, WIFI_SECOND_CHAN_NONE);

  fwd.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SET_ACK;
  fwd.payloadWifiChannel_st.currentChannel_u8 = newChannel;
  fwd.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(fwd.payloadHeader_st)), sizeof(fwd.payloadHeader_st) + sizeof(fwd.payloadWifiChannel_st));
#ifdef USB_JOYSTICK
  if (isHid) {
    tinyusbJoystick_.sendData((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  } else {
    ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  }
#else
  ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
#endif
  ActiveSerial->printf("[L]Wi-Fi channel successfully switched to %d.\n", newChannel);
}

void sendWifiChannelStatus(bool isHid) {
  DapWifiChannel_t fwd = {};
  fwd.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
  fwd.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
  fwd.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_WIFI_CHANNEL_U8;
  fwd.payloadHeader_st.version_u8 = DAP_VERSION_CONFIG_U8;
  fwd.payloadHeader_st.pedalTag_u8 = 3;
  fwd.payloadWifiChannel_st.command_u8 = WIFI_CH_CMD_SET_ACK;
  fwd.payloadWifiChannel_st.currentChannel_u8 = wirelessComm.getChannel();
  fwd.payloadWifiChannel_st.recommendedChannel_u8 = wirelessComm.getChannel();
  fwd.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
  fwd.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
  fwd.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)(&(fwd.payloadHeader_st)), sizeof(fwd.payloadHeader_st) + sizeof(fwd.payloadWifiChannel_st));
#ifdef USB_JOYSTICK
  if (isHid) {
    tinyusbJoystick_.sendData((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  } else {
    ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
  }
#else
  ActiveSerial->write((uint8_t*)&fwd, sizeof(DapWifiChannel_t));
#endif
}

void serialCommunicationRxTask( void * pvParameters)
{
  // Buffer to accumulate incoming serial data
  const size_t RX_BUFFER_SIZE = 1028; // Should be at least 2x the largest possible packet
  static uint8_t rx_buffer[RX_BUFFER_SIZE];
  static size_t buffer_len = 0;
  //configDataPackage_t configPackage_st;
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) 
    {
      //ActiveSerial->println("RX kick");
      // --- 1. Read all available data into our buffer ---
      if (ActiveSerial->available())
      {
        // Prevent buffer overflow by only reading what fits
        size_t bytesToRead = min((size_t)ActiveSerial->available(), RX_BUFFER_SIZE - buffer_len);
        if (bytesToRead > 0)
        {
          ActiveSerial->readBytes(&rx_buffer[buffer_len], bytesToRead);
          buffer_len += bytesToRead;
        }

        // ActiveSerial->println("Serial data available");
      }

      // --- 2. Process all complete packets in the buffer ---
      size_t buffer_idx = 0;
      while (buffer_idx < buffer_len)
      {
        // A. Find the next valid Start-of-Frame (SOF)
        if (rx_buffer[buffer_idx] != SOF_BYTE_0_U8 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1_U8))
        {
          buffer_idx++;
          continue; // Keep scanning for a SOF
        }

        // ActiveSerial->println("1st check passed");

        // SOF found at buffer_idx. Check if we have enough data for a header.
        if (buffer_len < buffer_idx + 3)
        {
          // Not enough data for a full header, stop parsing for now
          break;
        }

        // B. Get expected packet size from payload type
        uint8_t payloadType = rx_buffer[buffer_idx + 2];
        size_t expectedSize = getExpectedPacketSize(payloadType);

