orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
              DapMacAddresses_t reply = loadMacAddressesFromEeprom();
              reply.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_MAC_ADDRESSES_U8;
              reply.payloadHeader_st.version_u8 = DAP_VERSION_MAC_ADDRESSES_U8;
              reply.payloadHeader_st.storeToEeprom_u8 = 0;
              reply.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)&reply.payloadHeader_st, sizeof(reply.payloadHeader_st) + sizeof(reply.payloadMacAddresses_st));
              ActiveSerial->write((char*)&reply, sizeof(DapMacAddresses_t));
            }
            break;
          }
          //case action for servo config
          case DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8:
          {
            #ifndef USB_JOYSTICK
              bool structChecker = true;
              DAP_servo_config_st_t dap_servo_config_local;
              memcpy(&dap_servo_config_local, packet_start, sizeof(DAP_servo_config_st_t));
              
              if (dap_servo_config_local.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_SERVO_CONFIG_U8)
              {
                structChecker = false;
                structIsValid = false;
              }
              if (dap_servo_config_local.payloadHeader_st.version_u8 != DAP_VERSION_CONFIG_U8)
              {
                structChecker = false;
                structIsValid = false;
              }
              uint16_t crc = checksumCalculator((uint8_t *)(&(dap_servo_config_local.payloadHeader_st)), sizeof(dap_servo_config_local.payloadHeader_st) + sizeof(dap_servo_config_local.payloadServoConfig_st));
              if (crc != dap_servo_config_local.payloadFooter_st.checkSum_u16)
              {
                structChecker = false;
                structIsValid = false;
              }
              if (structChecker == true)
              {
                int pedalIdx = dap_servo_config_local.payloadHeader_st.pedalTag_u8;
                if(pedalIdx >= 0 && pedalIdx < 3)
                {
                  memcpy(&dap_servo_config_st[pedalIdx], &dap_servo_config_local, sizeof(DAP_servo_config_st_t));
                  update_servo_config[pedalIdx] = true;
                }
              }
            #endif
            break;
          }
          default:
          {
            ActiveSerial->println("[L]Unknown payload type");
            break;
          }
        }//switch end
        if (!structIsValid)
        {
          ActiveSerial->printf("[L]Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
          ActiveSerial->println("");
          buffer_idx++; // Skip the failed SOF and continue scanning
        }
        else
        {
          // Packet was valid and processed, advance index past this packet
          buffer_idx += expectedSize;
        }
      }//while end
      // --- 3. Clean up the buffer ---
      if (buffer_idx > 0)
      {
        size_t remaining_len = buffer_len - buffer_idx;
        if (remaining_len > 0)
        {
          memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
        }
        buffer_len = remaining_len;
      }
    }
  }
}


void serialCommunicationTxTask( void * pvParameters)
{
  for(;;)
  { 
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) 
    {
      //ActiveSerial->println("tx kick");
      uint16_t crc;
      unsigned long current_time=millis();
      #ifndef USB_JOYSTICK
        if(current_time-bridge_state_last_update>200)
        {
          basic_rssi_update=true;
          bridge_state_last_update=millis();
        }
      
        if(current_time-PedalUpdateLast>500)
        {
          PedalUpdateIntervalPrint_b=true;
          PedalUpdateLast=current_time;
        }
      #endif
      if(current_time-UARTJoystickUpdateLast>7)
      {
        UARTJoystickUpdate_b=true;
        UARTJoystickUpdateLast=current_time;
      }
      bool structChecker = true;
      #ifndef USB_JOYSTICK
        for(int i =0; i<3; i++)
        {
          if(g_updateBasicState_ab[i])
          {
            g_updateBasicState_ab[i]=false;
            ActiveSerial->write((char*)&dap_state_basic_st[i], sizeof(DapStateBasic_t));
            ActiveSerial->print("\r\n");
            if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]==0)
            {
              ActiveSerial->print("[L]Found Pedal:");
              ActiveSerial->println(dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
            }
            dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]=1;
            //g_pedalLastUpdate_au32[dap_state_basic_st[i].payloadHeader_st.pedalTag_u8]=millis();
            if(g_espNowError_ab[i])
            {
              ActiveSerial->print("[L]Pedal:");
              ActiveSerial->print(dap_state_basic_st[i].payloadHeader_st.pedalTag_u8);
              ActiveSerial->print(" E:");
              ActiveSerial->println(dap_state_basic_st[i].payloadPedalStateBasic_st.errorCode_u8);
              g_espNowError_ab[i]=false;    
            }
          }
          if(g_updateExtendState_ab[i])
          {
            g_updateExtendState_ab[i]=false;
            ActiveSerial->write((char*)&dap_state_extended_st[i], sizeof(DapStateExtended_t));
            ActiveSerial->print("\r\n");

          }
          
          // Forward Servo Config Responses to Host ---
          if(send_servo_config_to_host[i])
          {
            send_servo_config_to_host[i] = false;
            ActiveSerial->write((char*)&dap_servo_config_response_st[i], sizeof(DAP_servo_config_st_t));
            ActiveSerial->print("\r\n");
          }

        }
      
        int pedal_config_IDX=0;
        for(pedal_config_IDX=0;pedal_config_IDX<3;pedal_config_IDX++)
        {
          if(g_espNowRequestConfig_ab[pedal_config_IDX])
          {
            DapConfig_t * dap_config_st_local_ptr;
            DapConfig_t dap_config_st_local;
            if(pedal_config_IDX==0)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Clu, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Clu;
            }
            if(pedal_config_IDX==1)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Brk, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Brk;
            }
            if(pedal_config_IDX==2)
            {
              memcpy(&dap_config_st_local, &dap_config_st_Gas, sizeof(DapConfig_t));
              //dap_config_st_local_ptr = &dap_config_st_Gas;
            }
            dap_config_st_local_ptr= &dap_config_st_local;
            
            //uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_st.payloadHeader_st)), sizeof(dap_config_st.payloadHeader_st) + sizeof(dap_config_st.payloadPedalConfig_st));

