orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
            dap_config_st_local_ptr->payloadHeader_st.pedalTag_u8=dap_config_st_local_ptr->payloadPedalConfig_st.pedalType_u8;
            crc = checksumCalculator((uint8_t*)(&(dap_config_st_local.payloadHeader_st)), sizeof(dap_config_st_local.payloadHeader_st) + sizeof(dap_config_st_local.payloadPedalConfig_st));
            dap_config_st_local_ptr->payloadFooter_st.checkSum_u16 = crc;
            ActiveSerial->write((char*)dap_config_st_local_ptr, sizeof(DapConfig_t));
            ActiveSerial->print("\r\n");
            g_espNowRequestConfig_ab[pedal_config_IDX]=false;
            ActiveSerial->print("[L]Pedal:");
            ActiveSerial->print(pedal_config_IDX);
            ActiveSerial->println(" config returned");
            delay(3);
          }
        }
      

        if(basic_rssi_update)//Bridge action
        {
          //fill header and footer
          dap_bridge_state_st.payloadHeader_st.startOfFrame0_u8 = SOF_BYTE_0_U8;
          dap_bridge_state_st.payloadHeader_st.startOfFrame1_u8 = SOF_BYTE_1_U8;
          dap_bridge_state_st.payloadFooter_st.enfOfFrame0_u8 = EOF_BYTE_0_U8;
          dap_bridge_state_st.payloadFooter_st.enfOfFrame1_u8 = EOF_BYTE_1_U8;
          int rssi_filter_value=constrain(rssi_filter.process(g_rssiDisplay_i32),-100,0) ;
          dap_bridge_state_st.payloadHeader_st.pedalTag_u8=5; //5 means bridge
          dap_bridge_state_st.payloadHeader_st.payloadType_u8=DAP_PAYLOAD_TYPE_BRIDGE_STATE_U8;
          dap_bridge_state_st.payloadHeader_st.version_u8=DAP_VERSION_CONFIG_U8;
          dap_bridge_state_st.payloadBridgeState_st.bridgeAction_u8=0;
          memcpy(dap_bridge_state_st.payloadBridgeState_st.pedalRssiRealtime_ai32,wirelessComm.getRssiArray(),sizeof(int32_t)*3);
          //parse_version(BRIDGE_FIRMWARE_VERSION,&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[0],&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[1],&dap_bridge_state_st.payloadBridgeState_st.Bridge_firmware_version_u8[2]);
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[0]=versionMajor;
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[1]=versionMinor;
          dap_bridge_state_st.payloadBridgeState_st.bridgeFirmwareVersion_au8[2]=versionPatch;
          uint8_t unassignedCount = 0;
          memset(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8, 0, sizeof(dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8));
          for (int p = 0; p < 3; p++) {
            memcpy(&dap_bridge_state_st.payloadBridgeState_st.macAddressDetected_au8[p * 6], wirelessComm.getPedalMac(p), 6);
          }
          dap_bridge_state_st.payloadBridgeState_st.unassignedPedalCount_u8 = unassignedCount;
          //CRC check should be in the final
          crc = checksumCalculator((uint8_t*)(&(dap_bridge_state_st.payloadHeader_st)), sizeof(dap_bridge_state_st.payloadHeader_st) + sizeof(dap_bridge_state_st.payloadBridgeState_st));
          dap_bridge_state_st.payloadFooter_st.checkSum_u16=crc;
          DapBridgeState_t * dap_bridge_st_local_ptr;
          dap_bridge_st_local_ptr = &dap_bridge_state_st;
          ActiveSerial->write((char*)dap_bridge_st_local_ptr, sizeof(DapBridgeState_t));
          ActiveSerial->print("\r\n");
          basic_rssi_update=false;
          /*
          if(rssi_filter_value<-88)
          {
            ActiveSerial->println("Warning: BAD WIRELESS CONNECTION");
            //ActiveSerial->print("Pedal:");
            //ActiveSerial->print(dap_state_basic_st.payloadHeader_st.pedalTag_u8);
            ActiveSerial->print(" RSSI:");
            ActiveSerial->println(rssi_filter_value);  
          }
          */
          #ifdef ESPNow_debug
              ActiveSerial->print("Pedal:");
              ActiveSerial->print(dap_state_basic_st.payloadHeader_st.pedalTag_u8);
              ActiveSerial->print(" RSSI:");
              ActiveSerial->println(rssi_filter_value);
          #endif
        }
      #endif
        #ifdef External_RP2040
        if(UARTJoystickUpdate_b)
        {
          DAP_JoystickUART_State * dap_joystickUART_state_local_ptr;
          UARTJoystickUpdate_b=false;
          dap_joystickUART_state_lcl._payloadjoystick.payloadtype=(uint8_t)DAP_PAYLOAD_TYPE_JOYSTICKUART;
          dap_joystickUART_state_lcl._payloadjoystick.key = DAP_JOY_KEY;
          dap_joystickUART_state_lcl._payloadjoystick.DAP_JOY_Version = DAP_JOY_VERSION;
          for(int i=0; i<3;i++)
          {
            dap_joystickUART_state_lcl._payloadjoystick.controllerValue_i32[i] = wirelessComm.isPedalWirelessSyncEnabled(i) ? g_joystickValueOriginal_au16[i] : JOYSTICK_MIN_VALUE;
            dap_joystickUART_state_lcl._payloadjoystick.pedalAvailability[i] = wirelessComm.isPedalWirelessSyncEnabled(i) ? dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[i] : 0;
          }
          dap_joystickUART_state_lcl._payloadjoystick.pedal_status=g_pedalStatus_u8;
          dap_joystickUART_state_lcl._payloadfooter.checkSum_u16= checksumCalculator((uint8_t*)(&(dap_joystickUART_state_lcl._payloadjoystick)), sizeof(dap_joystickUART_state_lcl._payloadjoystick));
          _rp2040picoUART->UARTSendPacket((uint8_t*)&dap_joystickUART_state_lcl, sizeof(DAP_JoystickUART_State));
          if(dap_joystickUART_state_lcl._payloadjoystick.JoystickAction!=0)
          {
            dap_joystickUART_state_lcl._payloadjoystick.JoystickAction=0;
          }

        }
        #endif

      uint8_t pedalIDX;
      for(pedalIDX=0;pedalIDX<3;pedalIDX++)
      {
        unsigned long current_time=millis();
        if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[pedalIDX]==1)
        {
          if(current_time-g_pedalLastUpdate_au32[pedalIDX]>3000)
          {
            ActiveSerial->print("[L]Pedal:");
            ActiveSerial->print(pedalIDX);
            ActiveSerial->println(" Disconnected");
            dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[pedalIDX]=0;

