orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
          }
        }  
      }
      //print log from espnow
      #ifndef USB_JOYSTICK
        PayloadHidMessage_t receivedMsg;
        if (xQueueReceive(g_messageQueueHandle_pv, &receivedMsg, (TickType_t)0) == pdTRUE)
        {
          ActiveSerial->print("[L]");
          ActiveSerial->println(receivedMsg.text_ac);
          ActiveSerial->println("");
        }
      #endif
      /*
      if(getESPNOWLog_b)
      {
        getESPNOWLog_b=false;
        ActiveSerial->print("[L]");
        ActiveSerial->println(espnowLog);
      }
      */

      //debug message print
      #ifndef USB_JOYSTICK
        if(PedalUpdateIntervalPrint_b)
        {
          if(isBridgeInDebugMode_b)
          {
            for(pedalIDX=0;pedalIDX<3;pedalIDX++)
            {
              if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[pedalIDX]==1)
              {
                ActiveSerial->print("[L]Pedal ");
                ActiveSerial->print(pedalIDX);
                ActiveSerial->print(" Update interval: ");
                ActiveSerial->print(current_time-g_pedalLastUpdate_au32[pedalIDX]);
                ActiveSerial->print(" RSSI: ");
                ActiveSerial->println(wirelessComm.getRssi(pedalIDX));
              }
              
            }
            ActiveSerial->print("[L]sending:");
            printStructHex(&dap_bridge_state_st);
          }
          PedalUpdateIntervalPrint_b=false;
        }
      #endif
    }
    
    
    //delay(1);
  }
}

void joystickUpdateTask( void * pvParameters )
{
  unsigned long last_serial_joy_out = millis();
  unsigned long now;
  int16_t pedalJoystick_last[3] = {0, 0, 0};
  bool pedalJoystickUpdate_b = false;
  unsigned joystick_test_time = millis();
  bool print_value_b=false;
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {

      for (int i = 0; i < 3; i++)
      {
        if (pedalJoystick_last[i] != g_joystickValueOriginal_au16[i])
        {
          pedalJoystick_last[i] = g_joystickValueOriginal_au16[i];
          pedalJoystickUpdate_b = true;
        }
      }
      #ifdef USB_JOYSTICK
        if (IsControllerReady() /*&& pedalJoystickUpdate_b*/)
        {
          if(isBridgeInDebugMode_b)
          {
            ActiveSerial->print("[L]Throttle value:");
            ActiveSerial->println(g_pedalThrottleValue_u16);
            ActiveSerial->print("[L]Brake value:");
            ActiveSerial->println(g_pedalBrakeValue_u16);
            ActiveSerial->print("[L]Cluth value:");
            ActiveSerial->println(g_pedalClutchValue_u16);
          }
          if (g_pedalStatus_u8 == 0)
          {
            uint16_t clutchVal = wirelessComm.isPedalWirelessSyncEnabled(0) ? g_pedalClutchValue_u16 : JOYSTICK_MIN_VALUE;
            uint16_t brakeVal  = wirelessComm.isPedalWirelessSyncEnabled(1) ? g_pedalBrakeValue_u16  : JOYSTICK_MIN_VALUE;
            uint16_t throttleVal = wirelessComm.isPedalWirelessSyncEnabled(2) ? g_pedalThrottleValue_u16 : JOYSTICK_MIN_VALUE;

            SetControllerOutputValueAccelerator(clutchVal);
            SetControllerOutputValueBrake(brakeVal);
            SetControllerOutputValueThrottle(throttleVal);
            SetControllerOutputValueRudder(JOYSTICK_CENTER);
            SetControllerOutputValueRudder_brake(JOYSTICK_CENTER, JOYSTICK_CENTER);
          }
          if (g_pedalStatus_u8 == 1)
          {
            SetControllerOutputValueAccelerator(JOYSTICK_MIN_VALUE);
            SetControllerOutputValueBrake(JOYSTICK_MIN_VALUE);
            SetControllerOutputValueThrottle(JOYSTICK_MIN_VALUE);
            // 3% deadzone
            uint16_t rudderValue = wirelessComm.isPedalWirelessSyncEnabled(2) ? g_pedalThrottleValue_u16 : JOYSTICK_CENTER;
            if (rudderValue < ((int16_t)(0.47f * JOYSTICK_RANGE + JOYSTICK_MIN_VALUE)) || rudderValue > ((int16_t)(0.53f * JOYSTICK_RANGE + JOYSTICK_MIN_VALUE)))
            {
              SetControllerOutputValueRudder(rudderValue);
            }
            else
            {
              SetControllerOutputValueRudder((int16_t)(JOYSTICK_CENTER));
            }
            SetControllerOutputValueRudder_brake(JOYSTICK_MIN_VALUE, JOYSTICK_MIN_VALUE);
          }
          if (g_pedalStatus_u8 == 2)
          {
            SetControllerOutputValueAccelerator(JOYSTICK_MIN_VALUE);
            SetControllerOutputValueBrake(JOYSTICK_MIN_VALUE);
            SetControllerOutputValueThrottle(JOYSTICK_MIN_VALUE);

            uint16_t leftBrakeVal = (dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[0] == 1 && wirelessComm.isPedalWirelessSyncEnabled(0))
                                      ? g_pedalClutchValue_u16
                                      : (wirelessComm.isPedalWirelessSyncEnabled(1) ? g_pedalBrakeValue_u16 : JOYSTICK_MIN_VALUE);
            uint16_t rightBrakeVal = wirelessComm.isPedalWirelessSyncEnabled(2) ? g_pedalThrottleValue_u16 : JOYSTICK_MIN_VALUE;

            // In Toe Brake mode, the pedals act purely as independent wheel brakes:
            // Rudder yaw (X-axis) remains neutral (centered) with zero connection between pedals
            SetControllerOutputValueRudder(JOYSTICK_CENTER);

            // Output independent left and right wheel brakes on Y and Z axes
            SetControllerOutputValueRudder_brake(leftBrakeVal, rightBrakeVal);
          }
          joystickSendState();
          if (pedalJoystickUpdate_b)
          {
            joystickSendState();
            pedalJoystickUpdate_b = false;
          }
          

          // bool joystatus=GetJoystickStatus();
        }
        /*
        if (!GetJoystickStatus())
        {
          RestartJoystick();
          ActiveSerial->println("[L]HID Error, Restart Joystick...");
          // last_serial_joy_out=millis();
        }
          */
      #endif
      // set analog value
      #ifdef Using_analog_output

        uint16_t dacBrakeVal = wirelessComm.isPedalWirelessSyncEnabled(1) ? g_joystickValue_au16[1] : 0;
        uint16_t dacGasVal   = wirelessComm.isPedalWirelessSyncEnabled(2) ? g_joystickValue_au16[2] : 0;
        dacWrite(Analog_brk, (uint16_t)((float)(dacBrakeVal / (float)(JOYSTICK_RANGE)) * 255));
        dacWrite(Analog_gas, (uint16_t)((float)(dacGasVal / (float)(JOYSTICK_RANGE)) * 255));
      #endif
      // set MCP4728 analog value
      #ifdef Using_MCP4728
        // ActiveSerial->print("MCP/");
        now = millis();
        if (MCP_status)
        {
          /*
          if(now-last_serial_joy_out>1000)
          {
            ActiveSerial->print("MCP/");
            ActiveSerial->print(g_joystickValue_au16[0]);
            ActiveSerial->print("/");
            ActiveSerial->print(g_joystickValue_au16[1]);
            ActiveSerial->print("/");
            ActiveSerial->print(g_joystickValue_au16[2]);
          }
          */

