orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
          uint16_t mcpClu = wirelessComm.isPedalWirelessSyncEnabled(0) ? g_joystickValue_au16[0] : 0;
          uint16_t mcpBrk = wirelessComm.isPedalWirelessSyncEnabled(1) ? g_joystickValue_au16[1] : 0;
          uint16_t mcpGas = wirelessComm.isPedalWirelessSyncEnabled(2) ? g_joystickValue_au16[2] : 0;
          mcp.setChannelValue(MCP4728_CHANNEL_A, (uint16_t)((float)mcpClu / (float)JOYSTICK_RANGE * 0.8f * 4096));
          mcp.setChannelValue(MCP4728_CHANNEL_B, (uint16_t)((float)mcpBrk / (float)JOYSTICK_RANGE * 0.8f * 4096));
          mcp.setChannelValue(MCP4728_CHANNEL_C, (uint16_t)((float)mcpGas / (float)JOYSTICK_RANGE * 0.8f * 4096));
        }

      #endif
    }
  }
}

//OTA multitask
uint16_t OTA_count=0;
bool message_out_b=false;
bool OTA_enable_start=false;
uint32_t otaTask_stackSizeIdx_u32 = 0;
void otaUpdateTask( void * pvParameters )
{

  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      #ifdef OTA_Update
        if(OTA_count>200)
        {
          message_out_b=true;
          OTA_count=0;
        }
        else
        {
          OTA_count++;
        }

        
        if(OTA_enable_b)
        {
          if(message_out_b)
          {
            message_out_b=false;
            Serial1.println("[L]OTA enable flag on");
          }
          if(OTA_status)
          {
            
            //server.handleClient();
          }
          else
          {
            ActiveSerial->println("[L]de-initialize espnow");
            ActiveSerial->println("[L]wait...");
            esp_err_t result= wirelessComm.deinit();
            delay(200);
            if(result==ESP_OK)
            {
              OTA_status=true;
              delay(1000);
              //ota_wifi_initialize(APhost);
              wifi_initialized(SSID,PASS);
              delay(2000);
              ESP32OTAPull ota;
              char* Version_tag;
              int ret;
              ota.SetCallback(OTAcallback);
              ota.OverrideBoard(BRIDGE_BOARD);
              Version_tag=BRIDGE_FIRMWARE_VERSION;
              if(dap_action_ota_st.payloadOtaInfo_st.otaAction_u8==1)
              {
                Version_tag="0.0.0";
                ActiveSerial->println("Force update");
              }
              switch (dap_action_ota_st.payloadOtaInfo_st.modeSelect_u8)
              {
                case 1:
                  ActiveSerial->printf("[L]Flashing to latest Main, checking %s to see if an update is available...\n", JSON_URL_main);
                  ret = ota.CheckForOTAUpdate(JSON_URL_main, Version_tag);
                  ActiveSerial->printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  break;
                case 2:
                  ActiveSerial->printf("[L]Flashing to latest Dev, checking %s to see if an update is available...\n", JSON_URL_dev);
                  ret = ota.CheckForOTAUpdate(JSON_URL_dev, Version_tag);
                  ActiveSerial->printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  break;
                case 3:
                  ActiveSerial->printf("[L]Flashing to Daily build, checking %s to see if an update is available...\n", JSON_URL_dev);
                  ret = ota.CheckForOTAUpdate(JSON_URL_daily, Version_tag);
                  ActiveSerial->printf("[L]CheckForOTAUpdate returned %d (%s)\n\n", ret, errtext(ret));
                  break;
                default:
                break;
              }

              delay(3000);
            }

          }
        }
        
        //delay(2);
      #endif

      #ifdef PRINT_TASK_FREE_STACKSIZE_IN_WORDS
        if( otaTask_stackSizeIdx_u32 == 1000)
        {
          UBaseType_t stackHighWaterMark = uxTaskGetStackHighWaterMark(NULL);
          ActiveSerial->print("StackSize (OTA): ");
          ActiveSerial->println(stackHighWaterMark);
          otaTask_stackSizeIdx_u32 = 0;
        }
        otaTask_stackSizeIdx_u32++;
      #endif
      //delay(2);
    }
  }
}

//LED task

void ledUpdateTask( void * pvParameters)
{
  uint8_t LED_bright_index = 0;
  uint8_t LED_bright_direction = 1;
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      #ifdef LED_ENABLE_WAVESHARE
      //LED status update
        if(LED_Status==0)
        {
          if(LED_bright_index>30)
          {
            LED_bright_direction=-1;
          }
          if(LED_bright_index<2)
          {
            LED_bright_direction=1;
          }
          LED_bright_index=LED_bright_index+LED_bright_direction;
          pixels.setBrightness(LED_bright_index);
          uint8_t led_status=dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[0]+dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[1]*2+dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[2]*4;
          switch (led_status)
          {
            case 0:
              pixels.setPixelColor(0,0xff,0xff,0xff);
              //pixels.setPixelColor(0,0x52,0x00,0xff);//Orange
              pixels.show();
              break;
            case 1:
              pixels.setPixelColor(0,0xff,0x00,0x00);//Red
              pixels.show();
              break;
            case 2:
              pixels.setPixelColor(0,0xff,0x0f,0x00);//Orange
              pixels.show();
              break;
            case 3:
              pixels.setPixelColor(0,0x52,0x00,0xff);//Cyan
              pixels.show();
              break; 
            case 4:
              pixels.setPixelColor(0,0x5f,0x5f,0x00);//Yellow
              pixels.show();
              break;
            case 5:
              pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
              pixels.show();
              break;      
            case 6:
              pixels.setPixelColor(0,0x00,0xff,0x00);//Green
              pixels.show();
              break;  
            case 7:
              pixels.setPixelColor(0, 0x80, 0x00, 0x80);//Purple
              pixels.show();
              break;                                         
            default:
              break;
          }
          delay(150);           
        }
        if(LED_Status==1)//pairing
        {
          
          //delay(1000);
          pixels.setPixelColor(0,0xff,0x00,0x00);//Red       
          pixels.setBrightness(25);
          pixels.show();
          delay(500);
          pixels.setPixelColor(0,0x00,0x00,0x00);//fill no color      
          //pixels.setBrightness(0);
          pixels.show();
          delay(500);
        }

      #endif  
    //delay(10);
    }
  }
}

void ledUpdateDongleTask( void * pvParameters)
{
  uint8_t LED_bright_index = 0;
  uint8_t LED_bright_direction = 1;
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      #ifdef LED_ENABLE_DONGLE
      //LED status update
        if(LED_Status==0)
        {
          if(LED_bright_index>30)
          {
            LED_bright_direction=-1;
          }
          if(LED_bright_index<2)
          {
            LED_bright_direction=1;
          }
          LED_bright_index=LED_bright_index+LED_bright_direction;
          pixels.setBrightness(LED_bright_index);

          for(uint i=0;i<3;i++)
          {
            if(dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[i]==1)
            {
              pixels.setPixelColor(i,0xff,0x0f,0x00);//Orange
            }
            else
            {
              pixels.setPixelColor(i,0xff,0xff,0xff);//White
            }            
          }
          pixels.show();
          
          delay(150);           
        }
        if(LED_Status==1)//pairing
        {
          
          //delay(1000);
          for(uint i=0;i<3;i++)
          {
            pixels.setPixelColor(i,0xff,0x00,0x00);//Red  
          }
              
          pixels.setBrightness(25);
          pixels.show();
          delay(500);
          for(uint i=0;i<3;i++)
          {
            pixels.setPixelColor(i,0x00,0x00,0x00);//fill no color  
          }
            
          //pixels.setBrightness(0);
          pixels.show();
          delay(500);
        }

      #endif  
      //delay(10);
      }
  }
}


void fanatecUpdateTask(void * pvParameters) 
{
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      #ifdef Fanatec_comunication
        fanatec.communicationUpdate();
        if (fanatec.isPlugged()) {
          uint16_t throttleValue = g_pedalThrottleValue_u16;
          uint16_t brakeValue = g_pedalBrakeValue_u16;
          uint16_t clutchValue = g_pedalClutchValue_u16;
          uint16_t handbrakeValue = 0;             // Set if needed

          // Pedal input values to 0 - 10000
          throttleValue = map(throttleValue, 0, 10000, 0, 65535);
          brakeValue = map(brakeValue, 0, 10000, 0, 22000);
          clutchValue = map(clutchValue, 0, 10000, 0, 65535);

          // Set pedal values in FanatecInterface
          fanatec.setThrottle(throttleValue);
          fanatec.setBrake(brakeValue);
          fanatec.setClutch(clutchValue);
          fanatec.setHandbrake(handbrakeValue);
          
          fanatec.update();
        }
      #endif
    }
    //delay(10);
  }
}

void miscTask(void *pvParameters)
{
  for (;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      // Background misc tasks
    }
  }
}

void hidCommunicaitonRxTask(void *pvParameters)
{
  unsigned long scan_Last=0;
  unsigned long action_Last=0;
  for(;;)
  {
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0)
    {
      #ifdef USB_JOYSTICK
        // debug output
        if(tinyusbJoystick_.isInDebug)
        {
          ActiveSerial->print("[L]Report: ");
          for(int i =0; i<tinyusbJoystick_.buffSizeDis; i++)
          {
            ActiveSerial->print("0x");  
            if (tinyusbJoystick_.buffDis[i] < 16) ActiveSerial->print('0');
            ActiveSerial->print(tinyusbJoystick_.buffDis[i], HEX);
            ActiveSerial->print("-");
          }
          ActiveSerial->println("");
        }

        
