orosys/DIY-Sim-Racing-FFB-Pedal/ESP32_master/src/Main.cpp
        if(millis()- scan_Last>1000)
        {
          //tinyusbJoystick_.isGetData = false;
          
          scan_Last = millis();
        }
        for(int i=0; i<3;i++)
        {
          if(tinyusbJoystick_.isConfigGet[i])
          {
            //ActiveSerial->println("");
            //ActiveSerial->printf("[L]Get config for pedal: %d\n", i);
            int pedalIdx = tinyusbJoystick_.tmpConfig[i].payloadHeader_st.pedalTag_u8;
            memcpy(&dap_config_st[pedalIdx], &tinyusbJoystick_.tmpConfig[i], sizeof(DapConfig_t));
            configUpdateAvailable[pedalIdx] = true;
            tinyusbJoystick_.isConfigGet[i]=false;
          }
        }
        for(int i =0; i<8; i++)
        {
          if(tinyusbJoystick_.isActionGet[i])
          {
            //ActiveSerial->println("");
            //ActiveSerial->printf("[L]Get action for pedal: %d time: %lu\n", i, millis()-action_Last);
            //action_Last=millis();
            int pedalIdx = tinyusbJoystick_.tmpAction[i].payloadHeader_st.pedalTag_u8;
            uint8_t sysAction = tinyusbJoystick_.tmpAction[i].payloadPedalAction_st.systemAction_u8;
            if (sysAction == (uint8_t)PedalSystemAction::SET_ASSIGNMENT_0) {
              pushPedalAssignmentAction(pedalIdx, 0, tinyusbJoystick_.tmpAction[i]);
            } else if (sysAction == (uint8_t)PedalSystemAction::SET_ASSIGNMENT_1) {
              pushPedalAssignmentAction(pedalIdx, 1, tinyusbJoystick_.tmpAction[i]);
            } else if (sysAction == (uint8_t)PedalSystemAction::SET_ASSIGNMENT_2) {
              pushPedalAssignmentAction(pedalIdx, 2, tinyusbJoystick_.tmpAction[i]);
            } else if (sysAction == (uint8_t)PedalSystemAction::CLEAR_ASSIGNMENT) {
              clearPedalAssignmentAction(pedalIdx, tinyusbJoystick_.tmpAction[i]);
            } else if (sysAction == (uint8_t)PedalSystemAction::ASSIGNMENT_CHECK_BEEP) {
              if (pedalIdx >= 0 && pedalIdx < 3 && wirelessComm.getPedalMac(pedalIdx)[0] != 0) {
                wirelessComm.sendActionToPedal(pedalIdx, tinyusbJoystick_.tmpAction[i]);
              }
            } else if(pedalIdx == PEDAL_ID_CLUTCH || pedalIdx == PEDAL_ID_BRAKE || pedalIdx == PEDAL_ID_THROTTLE)
            {
              //forward to pedal
              memcpy(&dap_actions_st[pedalIdx], &tinyusbJoystick_.tmpAction[i], sizeof(DapActions_t));
              dap_action_update[pedalIdx] = true;
            }
            tinyusbJoystick_.isActionGet[i]=false;
          }
        }
                        if(tinyusbJoystick_.isMacAddressesGet)
        {
          DapMacAddresses_t macCfg = tinyusbJoystick_.tmpMacAddresses;
          if (macCfg.payloadHeader_st.storeToEeprom_u8 == 1)
          {
            storeMacAddressesToEeprom(macCfg);
            ActiveSerial->println("[L]Stored MAC addresses & channel to EEPROM");
            // Only a commit (storeToEeprom=1) carries a real MAC table - a
            // query (storeToEeprom=0, e.g. the plugin's UI auto-detect on
            // tab load) sends an all-zero payload just to ask for the
            // current table back, and must not overwrite the live one.
            wirelessComm.applyMacConfig(macCfg);
          }

          DapMacAddresses_t reply = loadMacAddressesFromEeprom();
          reply.payloadHeader_st.payloadType_u8 = DAP_PAYLOAD_TYPE_MAC_ADDRESSES_U8;
          reply.payloadHeader_st.version_u8 = DAP_VERSION_MAC_ADDRESSES_U8;
          reply.payloadHeader_st.storeToEeprom_u8 = 0;
          reply.payloadFooter_st.checkSum_u16 = checksumCalculator((uint8_t*)&reply.payloadHeader_st, sizeof(reply.payloadHeader_st) + sizeof(reply.payloadMacAddresses_st));
          tinyusbJoystick_.sendData((uint8_t*)&reply, sizeof(DapMacAddresses_t));

          tinyusbJoystick_.isMacAddressesGet = false;
        }
        if(tinyusbJoystick_.isWifiChannelGet)
        {
          uint8_t cmd = tinyusbJoystick_.tmpWifiChannel.payloadWifiChannel_st.command_u8;
          if (cmd == WIFI_CH_CMD_SCAN_REQ)
          {
            handleWifiScanRequest(true);
          }
          else if (cmd == WIFI_CH_CMD_SET_REQ)
          {
            uint8_t targetCh = tinyusbJoystick_.tmpWifiChannel.payloadWifiChannel_st.currentChannel_u8;
            if (targetCh < 1 || targetCh > 14) {
              targetCh = tinyusbJoystick_.tmpWifiChannel.payloadWifiChannel_st.recommendedChannel_u8;
            }
            handleWifiSetChannelRequest(targetCh, true);
          }
          else
          {
            sendWifiChannelStatus(true);
          }
          tinyusbJoystick_.isWifiChannelGet = false;
        }
        if(tinyusbJoystick_.isBridgeActionGet)
        {
          //ActiveSerial->println("");
          //ActiveSerial->printf("[L]Get Bridge action\n");
          memcpy(&dap_bridge_state_lcl, &tinyusbJoystick_.tmpBridgeAction, sizeof(DapBridgeState_t));
          if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_ENABLE_PAIRING)
          {
            #ifdef ESPNow_Pairing_function
              tinyusbJoystick_.printf("Bridge Pairing...");
              g_softwarePairingAction_b = true;
            #endif
            #ifndef ESPNow_Pairing_function
              tinyusbJoystick_.printf("Pairing command didn't supported");
            #endif
          }
          // action=2, restart
          if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_RESTART)
          {
            tinyusbJoystick_.printf("Bridge Restart");
            delay(1000);
            ESP.restart();
          }
          if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_DOWNLOAD_MODE)
          {
            // aciton=3 restart into boot mode
            #ifdef CONFIG_IDF_TARGET_ESP32S3
              tinyusbJoystick_.printf("Bridge Restart into Download mode");
              delay(1000);
              REG_WRITE(RTC_CNTL_OPTION1_REG, RTC_CNTL_FORCE_DOWNLOAD_BOOT);
              ESP.restart();
            #else
              ActiveSerial->println("[L]Command not supported ");
              delay(1000);
            #endif
          }
          if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_DEBUG)
          {
            if (isBridgeInDebugMode_b)
            {
            // aciton=4 print pedal update interval
              tinyusbJoystick_.printf("Bridge debug mode off.");
              isBridgeInDebugMode_b = false;
            }
            else
            {
              // aciton=4 print pedal update interval
              tinyusbJoystick_.printf("Bridge debug mode on.");
              firstDebugMessage_b = true;
              isBridgeInDebugMode_b = true;
            }
          }
          if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_JOYSTICK_FLASHING_MODE)
          {
            #ifdef External_RP2040
              ActiveSerial->println("[L]JOYSTICK restart into flashing mode");
              dap_joystickUART_state_lcl._payloadjoystick.JoystickAction = JOYSTICKACTION_RESET_INTO_BOOTLOADER;
            #else
              tinyusbJoystick_.printf("[L]The command is not supported");
            #endif
          }
          if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_JOYSTICK_DEBUG)
          {
            #ifdef External_RP2040
              ActiveSerial->println("[L]JOYSTICK debug mode on");
              dap_joystickUART_state_lcl._payloadjoystick.JoystickAction = JOYSTICKACTION_DEBUG_MODE;
            #else
              tinyusbJoystick_.printf("The command is not supported");
            #endif
          }
          if (dap_bridge_state_lcl.payloadBridgeState_st.bridgeAction_u8 == BRIDGE_ACTION_SET_PEDAL_WIRELESS_SYNC)
          {
            wirelessComm.setPedalWirelessSyncEnabled(0, dap_bridge_state_lcl.payloadBridgeState_st.pedalAvailability_au8[0] != 0);
            wirelessComm.setPedalWirelessSyncEnabled(1, dap_bridge_state_lcl.payloadBridgeState_st.pedalAvailability_au8[1] != 0);
            wirelessComm.setPedalWirelessSyncEnabled(2, dap_bridge_state_lcl.payloadBridgeState_st.pedalAvailability_au8[2] != 0);
            for (int pIdx = 0; pIdx < 3; pIdx++)
            {
              if (!wirelessComm.isPedalWirelessSyncEnabled(pIdx))
              {
                g_joystickValueOriginal_au16[pIdx] = JOYSTICK_MIN_VALUE;
                g_joystickValue_au16[pIdx] = JOYSTICK_MIN_VALUE;
                dap_bridge_state_st.payloadBridgeState_st.pedalAvailability_au8[pIdx] = 0;
                dap_bridge_state_st.payloadBridgeState_st.pedalRssiRealtime_ai32[pIdx] = 0;
                wirelessComm.setRssi(pIdx, 0);
                if (pIdx == 0) g_pedalClutchValue_u16 = JOYSTICK_MIN_VALUE;
                if (pIdx == 1) g_pedalBrakeValue_u16 = JOYSTICK_MIN_VALUE;
                if (pIdx == 2) g_pedalThrottleValue_u16 = JOYSTICK_MIN_VALUE;
              }
            }
          }
          tinyusbJoystick_.isBridgeActionGet=false;
        }
        if(tinyusbJoystick_.isOtaActionGet)
        {
          tinyusbJoystick_.printf("Get OTA Packet");
          memcpy(&dap_action_ota_st, &tinyusbJoystick_.tmpOtaAction, sizeof(DapActionOta_t));
          #ifdef OTA_Update
          bool structChecker_b = true;
          if (dap_action_ota_st.payloadHeader_st.payloadType_u8 != DAP_PAYLOAD_TYPE_ACTION_OTA_U8)
          {
            structChecker_b = false;
            //structIsValid = false;
          }
          if (structChecker_b)
          {
            SSID = new char[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8 + 1];
            PASS = new char[dap_action_ota_st.payloadOtaInfo_st.passLength_u8 + 1];
            memcpy(SSID, dap_action_ota_st.payloadOtaInfo_st.wifiSsid_au8, dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8);
            memcpy(PASS, dap_action_ota_st.payloadOtaInfo_st.wifiPass_au8, dap_action_ota_st.payloadOtaInfo_st.passLength_u8);
            SSID[dap_action_ota_st.payloadOtaInfo_st.ssidLength_u8] = 0;
            PASS[dap_action_ota_st.payloadOtaInfo_st.passLength_u8] = 0;
          }
          if (dap_action_ota_st.payloadOtaInfo_st.deviceId_u8 == DEVICE_ID && structChecker_b == true)
          {
            OTA_enable_b = true;
            tinyusbJoystick_.printf("Bridge OTA begin.");
          }
          else if (structChecker_b)
          {
            g_pedalOtaAction_b = true;
          }
          #endif
          tinyusbJoystick_.isOtaActionGet = false;    
        }
      #endif
    }
  }
}

